app/controllers/admin/directories_controller.rb

  def scan
    require 'find'

    # Load up the diretory
    directory = Directory.find(params[:id])
    list = Array.new
    @message = ''

    # Check if it's changed since last scan
    Find.find(directory.physical_path) { |path| list.push(path) }
    @digest = Digest::MD5.hexdigest(list.to_s)

    # If it's changed, scan it
    unless @digest == directory.digest

      # Delete old assets
      delete_count = 0
      Asset.find(:all).each do |asset|
---
SELECT * FROM `directories` WHERE (`directories`.`id` = 1)
SELECT * FROM `assets` WHERE (`assets`.directory_id = 1)

          asset_path = path.gsub(directory.physical_path, '')
          asset_type = directory.asset_types.find_by_extension(asset_extension)
          unless asset_type.blank?
            asset = directory.assets.find_or_initialize_by_path(asset_path)
---
SELECT * FROM `assets` WHERE (`assets`.`path` = 'Anchorman/Anchorman (2004).mkv') AND (`assets`.directory_id = 1) LIMIT 1

        @message = add_count.to_s+' new assets were added.'
      end
      if delete_count == 0 then
        @message << ' No assets were delete.'
---
INSERT INTO `assets` (`created_at`, `playable_type`, `playable_id`, `updated_at`, `directory_id`, `path`) VALUES('2009-07-05 06:13:28', NULL, NULL, '2009-07-05 06:13:28', 1, 'Little Miss Sunshine/Little Miss Sunshine.mkv')